plastikman/OpenBreath/sdkconfig.defaults
# DragonBreath default sdkconfig — ESP32-C3-MINI-1 (4MB flash)
CONFIG_IDF_TARGET="esp32c3"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Size-optimize (the app slot is ~1.8MB; stock image is ~1.3MB)
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Kconfig defaults production images to UART0 (CH340K USB-C bridge, GPIO21/20).
# Do not pin the choice here: the safe dev-board HIL overlay deliberately selects
# native USB Serial/JTAG. Native USB is NOT usable on Panda hardware because its
# D-/D+ pads are GPIO18/19 and GPIO18 drives the heater SSR.

# Task watchdog on — a hung control loop must not leave the heater energized.
# (pb_control subscribes via esp_task_wdt_add and pets it each loop.)
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# HTTP server: phone browsers send large header sets on POST — the 512B default
# request-header buffer overflows ("header fields are too long") when submitting
# the portal form. Bump it.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# OTA rollback: a web-flashed image boots in PENDING_VERIFY and is only made
# permanent once app_main reaches a healthy state (esp_ota_mark_app_valid_...).
# A crash before that rolls back to the previous working app on reboot — matters
# for a mains heater that must never be bricked into an undefined SSR state.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
